## Get Employee Count By Department

Let us get count of employees by department using tables setup as part of HR database.
* You can review the table structures of employees and departments by going to **06_task_setup_hr_db.ipynb**.
* If you cannot find one, please reach out to support staff.
* After validating connectivity and data in the tables, come up with a query which will get us the employee count by department.
* Output should contain department_name and count. You need to figure out the field on which join should be performed.

In [1]:
%load_ext sql

In [2]:
%env DATABASE_URL=postgresql://deepan:DB_PASSWORD@localhost:5432/itversity_hr_db

env: DATABASE_URL=postgresql://deepan:DB_PASSWORD@localhost:5432/itversity_hr_db

In [3]:
%%sql

SELECT * FROM departments LIMIT 10

10 rows affected.

[(10, 'Administration', 200, 1700),
 (20, 'Marketing', 201, 1800),
 (30, 'Purchasing', 114, 1700),
 (40, 'Human Resources', 203, 2400),
 (50, 'Shipping', 121, 1500),
 (60, 'IT', 103, 1400),
 (70, 'Public Relations', 204, 2700),
 (80, 'Sales', 145, 2500),
 (90, 'Executive', 100, 1700),
 (100, 'Finance', 108, 1700)]

In [4]:
%%sql

SELECT * FROM employees LIMIT 10

 * postgresql://deepan:***@localhost:5432/itversity_hr_db
10 rows affected.

[(100, 'Steven', 'King', 'SKING', '515.123.4567', datetime.date(1987, 6, 17), 'AD_PRES', Decimal('24000.00'), Decimal('NaN'), None, 90),
 (101, 'Neena', 'Kochhar', 'NKOCHHAR', '515.123.4568', datetime.date(1989, 9, 21), 'AD_VP', Decimal('17000.00'), Decimal('NaN'), 100, 90),
 (102, 'Lex', 'De Haan', 'LDEHAAN', '515.123.4569', datetime.date(1993, 1, 13), 'AD_VP', Decimal('17000.00'), Decimal('NaN'), 100, 90),
 (103, 'Alexander', 'Hunold', 'AHUNOLD', '590.423.4567', datetime.date(1990, 1, 3), 'IT_PROG', Decimal('9000.00'), Decimal('NaN'), 102, 60),
 (104, 'Bruce', 'Ernst', 'BERNST', '590.423.4568', datetime.date(1991, 5, 21), 'IT_PROG', Decimal('6000.00'), Decimal('NaN'), 103, 60),
 (105, 'David', 'Austin', 'DAUSTIN', '590.423.4569', datetime.date(1997, 6, 25), 'IT_PROG', Decimal('4800.00'), Decimal('NaN'), 103, 60),
 (106, 'Valli', 'Pataballa', 'VPATABAL', '590.423.4560', datetime.date(1998, 2, 5), 'IT_PROG', Decimal('4800.00'), Decimal('NaN'), 103, 60),
 (107, 'Diana', 'Lorentz', 'DLORENTZ', '590.423.5567', datetime.date(1999, 2, 7), 'IT_PROG', Decimal('4200.00'), Decimal('NaN'), 103, 60),
 (108, 'Nancy', 'Greenberg', 'NGREENBE', '515.124.4569', datetime.date(1994, 8, 17), 'FI_MGR', Decimal('12000.00'), Decimal('NaN'), 101, 100),
 (109, 'Daniel', 'Faviet', 'DFAVIET', '515.124.4169', datetime.date(1994, 8, 16), 'FI_ACCOUNT', Decimal('9000.00'), Decimal('NaN'), 108, 100)]

* Provide the query to get the employee count by department below. Make sure data is sorted in ascending order by department_name. Also the column names as part of the output should be **department_name** and **employee_count**.
* Here is the expected output.

|department_name|department_count|
|---|---|
|Accounting|2|
|Administration|1|
|Executive|3|
|Finance|6|
|Human Resources|1|
|IT|5|
|Marketing|2|
|Public Relations|1|
|Purchasing|6|
|Sales|34|
|Shipping|45|

In [8]:
%%sql

SELECT employees.department_id, department_name, count(1) FROM employees 
    INNER JOIN departments USING (department_id)
    GROUP BY department_name, department_id ORDER BY department_name

 * postgresql://deepan:***@localhost:5432/itversity_hr_db
11 rows affected.

[(110, 'Accounting', 3),
 (10, 'Administration', 1),
 (90, 'Executive', 3),
 (100, 'Finance', 6),
 (40, 'Human Resources', 1),
 (60, 'IT', 5),
 (20, 'Marketing', 2),
 (70, 'Public Relations', 1),
 (30, 'Purchasing', 6),
 (80, 'Sales', 34),
 (50, 'Shipping', 45)]

In [10]:
%%sql 

SELECT department_id, count(1) FROM employees GROUP BY department_id

 * postgresql://deepan:***@localhost:5432/itversity_hr_db
12 rows affected.

[(70, 1),
 (80, 34),
 (20, 2),
 (10, 1),
 (None, 1),
 (90, 3),
 (100, 6),
 (110, 3),
 (30, 6),
 (50, 45),
 (40, 1),
 (60, 5)]

In [11]:
%%sql 

SELECT * FROM employees WHERE department_id=110

 * postgresql://deepan:***@localhost:5432/itversity_hr_db
3 rows affected.

[(205, 'Shelley', 'Higgins', 'SHIGGINS', '515.123.8080', datetime.date(1994, 6, 7), 'AC_MGR', Decimal('12000.00'), Decimal('NaN'), 101, 110),
 (206, 'William', 'Gietz', 'WGIETZ', '515.123.8181', datetime.date(1994, 6, 7), 'AC_ACCOUNT', Decimal('8300.00'), Decimal('NaN'), 205, 110),
 (2000, None, None, None, None, None, None, None, None, None, 110)]